ConCards_back/src/Documents/ОперацияСоСчетом/ОперацияСоСчетом.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОперацияСоСчетом</name>
  <registerRecords>AccumulationRegister.ОстаткиНаСчетах</registerRecords>
  <attributes>
    <name>СчетСписания</name>
    <type>
      <types>CatalogRef.Продукты</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетПоступления</name>
    <type>
      <types>CatalogRef.Продукты</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийСоСчетами</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

ConCards_back/src/AccumulationRegisters/ОстаткиНаСчетах/ОстаткиНаСчетах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиНаСчетах</name>
  <resources>
    <name>Баланс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Счет</name>
    <type>
      <types>CatalogRef.Продукты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ConCards_back/src/Enums/ВидыОперацийСоСчетами/ВидыОперацийСоСчетами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийСоСчетами</name>
  <enumValues>
    <name>Пополнение</name>
  </enumValues>
  <enumValues>
    <name>Перевод</name>
  </enumValues>
  <enumValues>
    <name>СнятиеСредств</name>
  </enumValues>
  <enumValues>
    <name>Покупка</name>
  </enumValues>
</mdclass:Enum>

ConCards_back/src/Documents/ОперацияСоСчетом/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ,Режим)

	Если ВидОперации = Перечисления.ВидыОперацийСоСчетами.Пополнение Тогда
		ВидДвижения = ВидДвиженияНакопления.Приход;	
	Иначе
		ВидДвижения = ВидДвиженияНакопления.Расход;	
	КонецЕсли;

	// регистр ОстаткиНаСчетах
	Движения.ОстаткиНаСчетах.Записывать = Истина;
	Движение = Движения.ОстаткиНаСчетах.Добавить();
	Движение.ВидДвижения = ВидДвижения;
	Движение.Период = Дата;
	Движение.Пользователь = Пользователь;
	Движение.Счет = СчетСписания;
	Движение.Баланс = Сумма;

	Движения.ОстаткиНаСчетах.Записывать = Истина;
	Движения.ОстаткиНаСчетах.БлокироватьДляИзменения = Истина;
	Движения.Записать();

	Если Не ВидДвижения = ВидДвиженияНакопления.Приход Тогда
	//Контроль оотрицательного баланса
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ПРЕДСТАВЛЕНИЕ(ОстаткиНаСчетахОстатки.Счет) КАК СчетПредставление,
		|	ОстаткиНаСчетахОстатки.БалансОстаток КАК БалансОстаток
		|ИЗ
		|	РегистрНакопления.ОстаткиНаСчетах.Остатки(&МоментВремениВключая, Счет = &Счет) КАК ОстаткиНаСчетахОстатки
		|ГДЕ
		|	ОстаткиНаСчетахОстатки.БалансОстаток < 0";

		Запрос.УстановитьПараметр("МоментВремениВключая", Новый Граница(МоментВремени(), ВидГраницы.Включая));
		Запрос.УстановитьПараметр("Счет", СчетСписания);

		РезультатЗапроса = Запрос.Выполнить();

		Если Не РезультатЗапроса.Пустой() Тогда
			Отказ = Истина;

			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();

			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("На счету: %1 Не хватает денежных средств: %2!", Выборка.СчетПредставление,
				-Выборка.БалансОстаток);
			Сообщение.Сообщить();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
